# -*- encoding:utf-8 -*-

YES_NO = (
    ('0', u"否"),
    ('1', u"是"),
)
SEX_CHOICE = (
    ("M", u"男"),
    ("F", u"女")
)

USER_LEVEL = (
    (0, u"管理员"),
    (1, u"普通用户")
)

STATUS = (
    (0, u"禁用"),
    (1, u"正常"),
)


EVALUATION_TYPE = (
    (0, u"课程"),
    (1, u"志愿者"),
    (2, u"书籍"),
    (3, u"活动"),
    (9, u"其他")
)

EVALUATION = (
    (0, u"非常同意"),
    (1, u"同意"),
    (2, u"一般"),
    (3, u"不同意"),
    (4, u"非常不同意")
)

EVALUATION_OBJECT = (
    (0, u"活动主讲"),
)

COURSE_STATUS = (
    (0, u"未开始"),
    (1, u"已发布"),
    (2, u"已实施"),
    (3, u"结束"),
)

ACTIVITY_TYPE = (
    (0, u"阅读"),
    (1, u"伴读"),
    (9, u"其他")
)


VOLUNTEER_TYPE = (
    ('01', u"普通志愿者"),
    ('02', u"技术志愿者"),
    ('03', u"导师"),
    ('04', u"专家"),
    ('05', u"宣传志愿者"),
    ('99', u"其他类志愿者"),
)


VOLUNTEER_STATUS = (
    ('10', u"提交审核"),
    ('11', u"审核不通过"),
    ('20', u"审核通过/未培训"),
    ('21', u"已培训/未提交作业"),
    ('30', u"正式志愿者/已培训/已提交作业"),
    ('31', u"活跃志愿者"),
    ('32', u"睡眠志愿者"),

)


VOLUNTEER_LEVEL = (
    ('01', u"普通志愿者"),
    ('02', u"组长"),
    ('03', u"运营"),
    ('04', u"系统管理员"),

)


SEASON = (
    ('1', u"上学期"),
    ('2', u"下学期"),
)

YEARS = (
    ('2015', u"2015"),
    ('2016', u"2016"),
    ('2017', u"2017"),
    ('2018', u"2018"),
    ('2019', u"2019"),
    ('2020', u"2020"),

)

ASK_FOR_LEAVE_STATUS = (
    ('0', u"未确认"),
    ('1', u"已确认"),
)